**free

dcl-s variable1 char(10) inz('hola');

dsply variable2;
dsply variable;

//estos cambios son para la branch de diseñocompleto

main();
*inlr = *on;
return;




dcl-proc main;
   dcl-pi *n end-pi; 



end-proc;
