**free

dcl-s variable1 char(10) inz('hola');

dsply variable2;
dsply variable;
dsply variable5;


main();
main2();
*inlr = *on;
return;

dcl-proc main;
   dcl-pi *n end-pi; 

 //resta es la rama2

end-proc;

dcl-proc main2;

 //prueba rama 2

end-proc;