**free

dcl-s variable1 char(10) inz('hola');

dsply variable2;
dsply variable;

*/dsfadadgadf%char(
   /
   
   agdgagaa/

main();
*inlr = *on;
return;




dcl-proc main;
   dcl-pi *n end-pi; 



end-proc;
