**free

dcl-s variable1 char(10) inz('hola');

dsply variable2;
dsply variable;

dsply 'para prueba';

main();
*inlr = *on;
return;

//PRUBA




dcl-proc main;
   dcl-pi *n end-pi; 



end-proc;
