**free

dcl-s variable1 char(10) inz('hola');

dsply variable2;
dsply variable;


main();
*inlr = *on;
return;

dcl-proc main;
   dcl-pi *n end-pi; 

 //rama principal

end-proc;